CSI API ETABS v1
cGridSys.GetGridSys Method
 Retrieves the grid system specified by the Name item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGridSys(
	string Name,
	ref double x,
	ref double y,
	ref double RZ
)
Function GetGridSys (
	Name As String,
	ByRef x As Double,
	ByRef y As Double,
	ByRef RZ As Double
) As Integer
Dim instance As cGridSys
Dim Name As String
Dim x As Double
Dim y As Double
Dim RZ As Double
Dim returnValue As Integer
returnValue = instance.GetGridSys(Name,
	x, y, RZ)
int GetGridSys(
	String^ Name,
	double% x,
	double% y,
	double% RZ
)
abstract GetGridSys :
        Name : string *
        x : float byref *
        y : float byref *
        RZ : float byref -> int
Parameters
Name
Type: System.String
 The name of an existing grid system.
x
Type: System.Double
 The global X grid of the origin of the grid system. [L]
y
Type: System.Double
 The global Y grid of the origin of the grid system. [L]
RZ
Type: System.Double
 The rotation of an axis of the new grid system relative to the global grid system is defined as follows: (1) Rotate the grid system about the positive global Z-axis as defined by the RZ item. [deg]
Return Value
Type: Int32
 Returns zero if the grid system data is successfully retrieved, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new grid system
   ret = SapModel.GridSys.SetGridSys("GridSysA", 1000, 1000, 0, 0, 0, 0)
'get new grid system data
   ret = SapModel.GridSys.GetGridSys("GridSysA", x, y, z, RZ)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cGridSys Interface
ETABSv1 Namespace